Revit 2027 API
FamilyManager.SetValueString Method
Set the string value of a family parameter of the current family type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetValueString(
	FamilyParameter familyParameter,
	string value
)
Public Sub SetValueString (
	familyParameter As FamilyParameter,
	value As String
)
public:
void SetValueString(
	FamilyParameter^ familyParameter,
	String^ value
)
member SetValueString :
        familyParameter : FamilyParameter *
        value : string -> unit
Parameters
familyParameter FamilyParameter
The family parameter of current type.
value String
The new value string for family parameter.
Exceptions
Exception | Condition
ArgumentException |  Thrown when the input argument-"familyParameter" or "value"-is null.
ArgumentException |  Thrown when the input argument-"familyParameter"-is an invalid family parameter. or the input argument-"value"-is an illegal string.
ArgumentOutOfRangeException |  Thrown when the input argument-"familyParameter"-is out of range.
InvalidOperationException |  Thrown when the family parameter is determined by formula, or it is not a value type, or the current family type is invalid.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace